app/helpers/carts_helper.rb

SELECT "cart_lines".* FROM "cart_lines" WHERE "cart_lines"."cart_id" = $1
---
	def cart_lines_count(cart)
		count = 0
		cart.cart_lines.each do |line|