app/helpers/sessions_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1
---
	def current_user
		if (user_id = session[:user_id])
			@current_user ||= User.find_by(id: user_id)

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT 1
---
	def current_cart
		@cart = Cart.find_by(user_id: current_user.id)