app/controllers/cart_lines_controller.rb

INSERT INTO "cart_lines" ("product_id", "cart_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 27], ["cart_id", 52], ["quantity", 1], ["created_at", "2016-07-08 20:09:59.570954"], ["updated_at", "2016-07-08 20:09:59.570954"]]
---
	def create
		if CartLine.create_cart_line(cart_lines_params, current_cart) == true

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1  ORDER BY "carts"."id" ASC LIMIT 1  [["user_id", 9]]
SELECT "cart_lines".* FROM "cart_lines" WHERE "cart_lines"."cart_id" = $1  [["cart_id", 6]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1  ORDER BY "carts"."id" ASC LIMIT 1
---
		def set_scope
			cart = Cart.where(user_id: current_user.id)
			@scope = cart.first.cart_lines