app/controllers/products_controller.rb

	def create
		@product = Product.new(product_params)
		authorize @product
		respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Phone"], ["description", "Best Phone"], ["price", "399.92"], ["created_at", "2016-06-05 18:11:50.281298"], ["updated_at", "2016-06-05 18:11:50.281298"]]

	def update
		authorize @product
		if @product.update_attributes(product_params)
---
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "New Name"], ["updated_at", "2016-07-09 05:31:18.027523"], ["id", 301]]

	def destroy
		authorize @product
		@product.destroy
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 405]]