app/views/layouts/_header.html.erb

SELECT "cart_lines".* FROM "cart_lines" WHERE "cart_lines"."cart_id" = $1  [["cart_id", 6]]
SELECT COUNT(*) FROM "cart_lines" WHERE "cart_lines"."cart_id" = $1  [["cart_id", 6]]
---
        <% if logged_in? %>
          <li><%= link_to "Cart #{current_cart.cart_lines.count}", carts_path %></li>